nxp-mcuxpresso/mcuxsdk-examples/_boards/evkmcimx7ulp/common/pin_mux/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPF1550Pins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: cm4}
- pin_list:
  - {pin_num: AG16, peripheral: PTA, signal: 'port, 12', pin_signal: PTA12, direction: OUTPUT, OBE: OBE_1_Enabled}
  - {pin_num: AB7, peripheral: PTB, signal: 'port, 11', pin_signal: PTB11, direction: INPUT, IBE: IBE_1_Enabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPF1550Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPF1550Pins(void) {                          /*!< Function assigned for the core: Cortex-M4[cm4] */
    IOMUXC_SetPinMux(IOMUXC_PTA12_PTA12, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTA12_PTA12,
                        IOMUXC0_SW_MUX_CTL_PAD_OBE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTB11_PTB11, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTB11_PTB11,
                        IOMUXC0_SW_MUX_CTL_PAD_IBE_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitTPM0Pins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: cm4}
- pin_list:
  - {pin_num: AD15, peripheral: TPM0, signal: 'tpm_ch, 3', pin_signal: PTA4}
  - {pin_num: AC15, peripheral: TPM0, signal: 'tpm_ch, 4', pin_signal: PTA5}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitTPM0Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitTPM0Pins(void) {                            /*!< Function assigned for the core: Cortex-M4[cm4] */
    IOMUXC_SetPinMux(IOMUXC_PTA4_TPM0_CH3, 0U);
    IOMUXC_SetPinMux(IOMUXC_PTA5_TPM0_CH4, 0U);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLPSPI0Pins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: cm4}
- pin_list:
  - {pin_num: AD20, peripheral: LPSPI0, signal: 'lpspi_pcs, 3', pin_signal: PTA23}
  - {pin_num: AD19, peripheral: LPSPI0, signal: lpspi_sck, pin_signal: PTA17}
  - {pin_num: AD22, peripheral: LPSPI0, signal: lpspi_sin, pin_signal: PTA20}
  - {pin_num: AG18, peripheral: LPSPI0, signal: lpspi_sout, pin_signal: PTA16}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLPSPI0Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLPSPI0Pins(void) {                          /*!< Function assigned for the core: Cortex-M4[cm4] */
    IOMUXC_SetPinMux(IOMUXC_PTA16_LPSPI0_SOUT, 0U);
    IOMUXC_SetPinMux(IOMUXC_PTA17_LPSPI0_SCK, 0U);
    IOMUXC_SetPinMux(IOMUXC_PTA20_LPSPI0_SIN, 0U);
    IOMUXC_SetPinMux(IOMUXC_PTA23_LPSPI0_PCS3, 0U);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitTPM2Pins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: cm4}
- pin_list:
  - {pin_num: AD18, peripheral: TPM2, signal: 'tpm_ch, 0', pin_signal: PTA11, PE: PE_1_pull_enabled, PS: PS_1_pull_up}
  - {pin_num: AG2, peripheral: TPM2, signal: 'tpm_ch, 1', pin_signal: PTB0, PE: PE_1_pull_enabled, PS: PS_1_pull_up}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitTPM2Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitTPM2Pins(void) {                            /*!< Function assigned for the core: Cortex-M4[cm4] */
    IOMUXC_SetPinMux(IOMUXC_PTA11_TPM2_CH0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTA11_TPM2_CH0,
                        IOMUXC0_SW_MUX_CTL_PAD_PE_MASK |
                        IOMUXC0_SW_MUX_CTL_PAD_PS_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTB0_TPM2_CH1, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTB0_TPM2_CH1,
                        IOMUXC0_SW_MUX_CTL_PAD_PE_MASK |
                        IOMUXC0_SW_MUX_CTL_PAD_PS_MASK);
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
